#include <stdio.h>
#include <stdlib.h>
/*1.看幾個word 2.switch把字母轉摩斯密碼 
3.一個一個讀，轉，記錄在陣列 4.看幾組密碼 5.建函式看有沒有一樣的 
然後我實在搞不懂字母和密碼的長度到底多少，水*/
FILE *p1,*p2;
int main() 
{	
/////////////////////讀檔///////////////////////////////////////////////////////////////////////////////////////////////
	p1 = fopen("test3.txt","r");
    if(p1==NULL)
	{
        printf("Open failure");
        return 1;
    }	
	else
	{
		int n1,n2,i,j;
/////////////////////看有幾組///////////////////////////////////////////////////////////////////////////////////////////////
		fscanf(p1,"%d\n",&n1);
/////////////////////一行一行讀/////////////////////////////////////////////////////////////////////////////////////////////
		char c[n1][100];//n1個單字，每字最多100字母 
		for(i=0;i<n1;i++)
		{
			for(j=0;j<100;j++)
			{
				c[i][j] = fgetc(p1);
				if( c[i][j] == '\n' )
				{
					break;
				}
			}
		}
///////////////////查神奇的字典，轉換 /////////////////////////////////////////////////////////v///////////////////
		char m[n1][500];//n1個單字，最多500個密碼 	
		int k=0;	
		for(i=0;i<n1;i++)//初始化 
		{
			for(j=0;j<500;j++)
			{		
				m[i][j]='0';
			}
		}
		for(i=0;i<n1;i++) 
		{
			for(j=0;j<100;j++)
			{					
				if(c[i][j] == '\n') 
				{
					break;
				}
				else if(c[i][j] == 'A') 
				{	
					m[i][k++]='.';
					m[i][k++]='-';
				}
				else if(c[i][j] == 'B')
				{
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='.';
				}			
				else if(c[i][j] == 'C')
				{
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='-';
					m[i][k++]='.';
				}					
				else if(c[i][j] == 'D')
				{
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='.';
				}					
				else if(c[i][j] == 'E')
				{
					m[i][k++]='.';
				}					
				else if(c[i][j] == 'F')
				{
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='-';
					m[i][k++]='.';
				}					
				else if(c[i][j] == 'G')
				{
					m[i][k++]='-';
					m[i][k++]='-';
					m[i][k++]='.';
				}					
				else if(c[i][j] == 'H')
				{
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='.';
				}				
				else if(c[i][j] == 'I')
				{
					m[i][k++]='.';
					m[i][k++]='.';
				}					
				else if(c[i][j] == 'J')
				{
					m[i][k++]='.';
					m[i][k++]='-';
					m[i][k++]='-';
					m[i][k++]='-';
				}					
				else if(c[i][j] == 'K')
				{
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='-';
				}
				else if(c[i][j] == 'L')
				{
					m[i][k++]='.';
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='.';
				}
				else if(c[i][j] == 'M')
				{
					m[i][k++]='-';
					m[i][k++]='-';
				}						
				else if(c[i][j] == 'N')
				{
					m[i][k++]='-';
					m[i][k++]='.';
				}						
				else if(c[i][j] == 'O')
				{
					m[i][k++]='-';
					m[i][k++]='-';
					m[i][k++]='-';
				}						
				else if(c[i][j] == 'P')
				{
					m[i][k++]='.';
					m[i][k++]='-';
					m[i][k++]='-';
					m[i][k++]='.';
				}						
				else if(c[i][j] == 'Q')
				{
					m[i][k++]='-';
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='-';
				}						
				else if(c[i][j] == 'R')
				{
					m[i][k++]='.';
					m[i][k++]='-';
					m[i][k++]='.';
				}					
				else if(c[i][j] == 'S')
				{
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='.';
				}						
				else if(c[i][j] == 'T')
				{
					m[i][k++]='-';
				}									
				else if(c[i][j] == 'U')
				{
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='-';
				}					
				else if(c[i][j] == 'V')
				{
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='-';
				}					
				else if(c[i][j] == 'W')
				{
					m[i][k++]='.';
					m[i][k++]='-';
					m[i][k++]='-';
				}					
				else if(c[i][j] == 'X')
				{
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='.';
					m[i][k++]='-';
				}					
				else if(c[i][j] == 'Y')
				{
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='-';
					m[i][k++]='-';
				}					
				else if(c[i][j] == 'Z')
				{
					m[i][k++]='-';
					m[i][k++]='-';
					m[i][k++]='.';
					m[i][k++]='.';
				}
			}
			k=0;//歸零，換新單字 
		}			
//////////////////////再看有幾組////////////////////////////////////////////////////////////////////////////////////////////
		fscanf(p1,"%d\n",&n2);
/////////////////////最後判斷///////////////////////////////////////////////////////////////////////////////////////////////
		//輸出檔案 
		p2 = fopen("output.txt","w");
        if( NULL == p2 )
		{
            printf( "open p2 failure" );
            return 1;
        }
        else
		{
			char c2[n2][500];	
			int t=-1;	
			for(i=0;i<n2;i++)//初始化
			{
				for(j=0;j<500;j++)
				{
					c2[i][j] = '0';
				}
			}
			for(i=0;i<n2;i++)//讀黨 
			{
				for(j=0;j<500;j++)
				{
					c2[i][j] = fgetc(p1);
					if( c2[i][j] == '\n'  || c2[i][j] == EOF)
					{
						c2[i][j] = '0';
						break;
					}
				}
			}		
			//判斷
			for(i=0;i<n2;i++)
			{
				
				for(j=0;j<n1;j++)
				{
					for(k=0;k<500;k++)
					{
						if( c2[i][k] == m[j][k] )
						{
							if(k==499)//完全一樣 
							{
								t=1;
								break;
							}
						}
						else
							break;
					}
				}
				if(t==1)
				{
					for(k=0;k<500;k++)
					{	
						if(c2[i][k]=='0')
							break;
						else
							fprintf(p2,"%c",c2[i][k]);
					}
					fprintf(p2,"is found in the dictionary.\n");
				}
				else
				{
					for(k=0;k<500;k++)
					{	
						if(c2[i][k]=='0')
							break;
						else
							fprintf(p2,"%c",c2[i][k]);
					}
					fprintf(p2,"is not found in the dictionary.\n");
				}
				t=-1;
			}
		}
 	}
	fclose(p1);
	return 0;
}

